app/Http/Controllers/CobaController.php

    public function index()
    {
        // mengambil data dari table jabatan
        $jabatan = DB::table('jabatan')->get();
---
select * from `jabatan`