app/Http/Controllers/ResourceKaryawanController.php

select * from `jabatan` order by `nama_jabatan` asc
select * from `jabatan` where `jabatan`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11)
select * from `karyawan`
---
    public function index()
    {
        // //ORM
        $jabatan = Jabatan::orderBy('nama_jabatan')->get();
        //$karyawan = Karyawan::with('jabatan')->get();
        //return $karyawan;
        // return view('data-karyawan', compact('jabatan', 'karyawan'));

        //ajax javascript
        if(request()->ajax()) {
            //return datatables()->of(Company::select('*'))
            return datatables()->of(Karyawan::with('jabatan')->get())
            ->addColumn('action', function($data) {
                return '
                    <center>
                        <a href="javascript:void(0)" data-toggle="tooltip" onClick="editFunc('. $data->id .')" data-original-title="Edit"
                            class="edit btn btn-warning">
                            Edit
                        </a>
                        <a href="javascript:void(0);" id="delete-karyawan" onClick="deleteFunc('. $data->id .')" data-toggle="tooltip"
                            data-original-title="Delete" class="delete btn btn-danger">
                            Delete
                        </a>
                    </center>
                ';
            })
            ->rawColumns(['action'])
            ->addIndexColumn()
            ->make(true);

insert into `karyawan` (`id`, `nama_karyawan`, `jabatan_id`, `updated_at`, `created_at`) values ('', 'RIAN', '7', '2023-03-07 02:24:05', '2023-03-07 02:24:05')
---
    public function store(Request $request)
    {
        // // insert data ke table karyawan
        // Karyawan::create([
        //     'nama_karyawan' => strtoupper($request->nama_karyawan),
        //     'jabatan_id' => strtoupper($request->jabatan_id)
        // ]);

        // // alihkan halaman ke halaman karyawan
        // return redirect('/karyawan');

        //ajax javascript
        $karyawan   =   Karyawan::updateOrCreate(
                    [
                     'id' => $request->id
                    ],
                    [
                        'nama_karyawan' => strtoupper($request->nama_karyawan),
                        'jabatan_id' => strtoupper($request->jabatan_id)
                    ]);

select * from `jabatan` where `jabatan`.`id` in (7)
select * from `karyawan` where `id` = '1' limit 1
---
    public function edit($id)
    {
        // $karyawan = Karyawan::findorfail($id);
        // $jabatan = Jabatan::all();
        // return view('edit-karyawan', compact('karyawan', 'jabatan'));

        //ajax javascript
        $karyawan = Karyawan::with('jabatan')->where('id', $id)->first();

delete from `karyawan` where `id` = '1400'
---
    public function destroy($id)
    {
        // // menghapus data pegawai berdasarkan id yang dipilih
        // DB::table('karyawan')->where('id', $id)->delete();

        // // alihkan halaman ke halaman pegawai
        // return redirect('/karyawan');

        //ajax javascript
        $karyawan = Karyawan::where('id',$id)->delete();