app/Http/Controllers/ResourceKaryawanController.php

    public function edit($id)
    {
        $karyawan = Karyawan::findorfail($id);
---
select * from `karyawan` where (`id` is null) limit 1

    public function update(Request $request, $id)
    {
        $karyawan = Karyawan::findorfail($request->id);
        $karyawan_data = [
            'nama_karyawan' => strtoupper($request->nama_karyawan),
            'jabatan_id' => strtoupper($request->jabatan_id)
        ];
        $karyawan->update($karyawan_data);
---
select * from `karyawan` where (`id` = '1') limit 1
update `karyawan` set `nama_karyawan` = 'BAMBANG SARIYONO L', `karyawan`.`updated_at` = '2023-03-07 08:22:37' where `id` = 1